Revit 2027 API
ParameterTypeId.StairsLandingtypeThickness Property
 "Monolithic Thickness": Default thickness
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StairsLandingtypeThickness { get; }
Public Shared ReadOnly Property StairsLandingtypeThickness As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StairsLandingtypeThickness {
	ForgeTypeId^ get ();
}
static member StairsLandingtypeThickness : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace